Revit 2027 API
ParameterFilterRuleFactory.CreateHasNoValueParameterRule Method
 Creates a filter rule that determines whether an element's parameter does not have a value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FilterRule CreateHasNoValueParameterRule(
	ElementId parameter
)
Public Shared Function CreateHasNoValueParameterRule (
	parameter As ElementId
) As FilterRule
public:
static FilterRule^ CreateHasNoValueParameterRule(
	ElementId^ parameter
)
static member CreateHasNoValueParameterRule :
        parameter : ElementId -> FilterRule
Parameters
parameter ElementId
 The parameter to be evaluated by the filter.
Return Value
FilterRule
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterFilterRuleFactory Class
Autodesk.Revit.DB Namespace